mentatpsi/Microchip/Microchip/Graphics/GDD/Default_Template/Configs/HWP_MEB_PIC32_GP_SK_16PMP.h
        // Definitions for POWER ON pin
        #define DisplayPowerConfig()        
        #define DisplayPowerOn()            
        #define DisplayPowerOff()  
        
         // Definitions for backlight control pin
        #define DisplayBacklightConfig()    (TRISDbits.TRISD0 = 0)  
        #define DisplayBacklightOn()        (LATDbits.LATD0 = BACKLIGHT_ENABLE_LEVEL)
        #define DisplayBacklightOff()       (LATDbits.LATD0 = BACKLIGHT_DISABLE_LEVEL)    
        
    #else
	     /********
	     * PIC32 will use the SET and CLR SFRs for the I/O.
	     * These are atomic settings that are recommended when
	     * modifying SFRs
	     ********/
	     // Definitions for reset pin
	     #define DisplayResetConfig()           TRISACLR = _TRISA_TRISA10_MASK    
	     #define DisplayResetEnable()           LATACLR = _LATA_LATA10_MASK
	     #define DisplayResetDisable()          LATASET = _LATA_LATA10_MASK
	
	     // Definitions for RS pin
	     #define DisplayCmdDataConfig()         AD1PCFGSET = _AD1PCFG_PCFG10_MASK, TRISBCLR = _TRISB_TRISB10_MASK
	     #define DisplaySetCommand()            LATBCLR = _LATB_LATB10_MASK
	     #define DisplaySetData()               LATBSET = _LATB_LATB10_MASK
	
	     // Definitions for CS pin
	     #define DisplayConfig()                TRISGCLR = _TRISG_TRISG13_MASK
	     #define DisplayEnable()                LATGCLR = _LATG_LATG13_MASK
	     #define DisplayDisable()               LATGSET = _LATG_LATG13_MASK
	
	     // Definitions for FLASH CS pin
	     #define DisplayFlashConfig()          
	     #define DisplayFlashEnable()        
	     #define DisplayFlashDisable()       
	
	     // Definitions for POWER ON pin
	     #define DisplayPowerConfig()        
	     #define DisplayPowerOn()            
	     #define DisplayPowerOff()           
	
	    #define DisplayBacklightConfig()    (TRISDbits.TRISD0 = 0)  
	    #define DisplayBacklightOn()        (LATDbits.LATD0 = BACKLIGHT_ENABLE_LEVEL)
	    #define DisplayBacklightOff()       (LATDbits.LATD0 = BACKLIGHT_DISABLE_LEVEL)   
	    
	#endif
    
// end of #elif defined (MEB_BOARD)

// -----------------------------------
// When using PIC24FJ256DA210 Development Board
// -----------------------------------
/*
    This development board only has PIC24FJ256DA210 device.
*/

#elif defined (PIC24FJ256DA210_DEV_BOARD)
	
    // Definitions for POWER ON pin
    #define DisplayPowerConfig()            TRISAbits.TRISA5 = 0       
    #define DisplayPowerOn()                LATAbits.LATA5 = 1           
    #define DisplayPowerOff()               LATAbits.LATA5 = 0

    // Definitions for backlight control pin
    #define DisplayBacklightConfig()        
    #define DisplayBacklightOn()        
    #define DisplayBacklightOff()          
    
    // Dummy definitions
    // Definitions for reset pin
    #define DisplayResetConfig()           
    #define DisplayResetEnable()           
    #define DisplayResetDisable()          

    // Definitions for RS pin
    #define DisplayCmdDataConfig()         
    #define DisplaySetCommand()            
    #define DisplaySetData()               

    // Definitions for CS pin
    #define DisplayConfig()                
    #define DisplayEnable()                
    #define DisplayDisable()               
    

// end of #elif defined (PIC24FJ256DA210_DEV_BOARD)

// -----------------------------------
// When using MIKRO_BOARD
// -----------------------------------
/*
    This development board family currently supports:
    - Mikromedia Board for PIC24 (TMIK010)
*/

#elif defined (MIKRO_BOARD)
	#if defined(__PIC24FJ256GB110__)
    // Definitions for reset pin
    #define DisplayResetConfig()        TRISCbits.TRISC1 = 0    
    #define DisplayResetEnable()        LATCbits.LATC1 = 0
    #define DisplayResetDisable()       LATCbits.LATC1 = 1

    // Definitions for RS pin
    #define DisplayCmdDataConfig()      TRISBbits.TRISB15 = 0
    #define DisplaySetCommand()         LATBbits.LATB15 = 0
    #define DisplaySetData()            LATBbits.LATB15 = 1

    // Definitions for CS pin
    #define DisplayConfig()             TRISFbits.TRISF12 = 0             
    #define DisplayEnable()             LATFbits.LATF12 = 0
    #define DisplayDisable()            LATFbits.LATF12 = 1


    // Definitions for FLASH CS pin
    #define DisplayFlashConfig()       
    #define DisplayFlashEnable()       
    #define DisplayFlashDisable()      

    // Definitions for POWER ON pin
    #define DisplayPowerConfig()       
    #define DisplayPowerOn()           
    #define DisplayPowerOff()          

    // Definitions for backlight control pin
    #define DisplayBacklightConfig()      
    #define DisplayBacklightOn()        
    #define DisplayBacklightOff()      
	#endif
// end of #elif defined (MIKRO_BOARD)

#endif 

/*********************************************************************
* HARDWARE PROFILE FOR THE RESISTIVE TOUCHSCREEN 
*********************************************************************/
/*
	These are the hardware settings for the 4-wire resistive
	touch screen. There are two analog inputs and two digital I/Os
	needed. 
	
	This portion is divided into 3 components
	1. IO and ADC channels settings - sets up the IO pins used and the
	   ADC channel selected to evaluate the screen touch. 
	2. Touch Screen X and Y orientation settings - sets up the
	   x and y directions. This is dependent on how the resistive
	   touch signals (X-, Y-, X+, and Y+) are wired up to the 
	   IOs and ADC signals with respect to the orientation of the
	   screen. Based on these factors, we can control the calculation
	   of the touch by swapping x and/or y and flipping the x and/or y 
	   directions.
	3. Touch Screen Non-Volatile Memory Storage Macros - this defines
	   the non-volatile memory read, write and sector erase functions
	   to be used when reading or storing calibration values.    
	
	The resistive touch screen driver assumes the following: 
	1. X+ and Y+ are mapped to the A/D inputs
	2. X- and Y- are mapped to the pure digital I/Os
*/

