mentatpsi/Microchip/Microchip/Graphics/GDD/Default_Template/Configs/HWP_MEB_PIC32_GP_SK_16PMP.h
       #else	//#else defined (__PIC24F__) || defined(__dsPIC33E__) || defined(__PIC24E__)

			// ADC channel constants
			// Potentiometer and Temperature sensor
			#if defined(__PIC24F__) 

			    #define ADC_TEMP        4
			    #define ADC_POT         5
    			#define ADC_XPOS        11
    			#define ADC_YPOS        10

                // ADC Port Control Bits
                #if defined(__PIC24FJ256GB210__)
                    #define ADC_POT_PCFG	ANSBbits.ANSB5
                    #define ADPCFG_XPOS		ANSBbits.ANSB11
                    #define ADPCFG_YPOS		ANSBbits.ANSB10
                #else
                    #define ADC_POT_PCFG    AD1PCFGbits.PCFG5
                    #define ADPCFG_XPOS		AD1PCFGbits.PCFG11
                    #define ADPCFG_YPOS		AD1PCFGbits.PCFG10
                #endif
                
                #define RESISTIVETOUCH_ANALOG  0
                #define RESISTIVETOUCH_DIGITAL 1
    
                // X port definitions
                #define ResistiveTouchScreen_XPlus_Drive_High()         LATBbits.LATB11   = 1
                #define ResistiveTouchScreen_XPlus_Drive_Low()          LATBbits.LATB11   = 0
                #define ResistiveTouchScreen_XPlus_Config_As_Input()    TRISBbits.TRISB11 = 1
                #define ResistiveTouchScreen_XPlus_Config_As_Output()   TRISBbits.TRISB11 = 0
    			
                #define ResistiveTouchScreen_XMinus_Drive_High()        LATDbits.LATD9    = 1   
                #define ResistiveTouchScreen_XMinus_Drive_Low()         LATDbits.LATD9    = 0
                #define ResistiveTouchScreen_XMinus_Config_As_Input()   TRISDbits.TRISD9  = 1  
                #define ResistiveTouchScreen_XMinus_Config_As_Output()  TRISDbits.TRISD9  = 0
    			
                // Y port definitions
                #define ResistiveTouchScreen_YPlus_Drive_High()         LATBbits.LATB10   = 1
                #define ResistiveTouchScreen_YPlus_Drive_Low()          LATBbits.LATB10   = 0
                #define ResistiveTouchScreen_YPlus_Config_As_Input()    TRISBbits.TRISB10 = 1
                #define ResistiveTouchScreen_YPlus_Config_As_Output()   TRISBbits.TRISB10 = 0
                
                #define ResistiveTouchScreen_YMinus_Drive_High()        LATDbits.LATD8    = 1   
                #define ResistiveTouchScreen_YMinus_Drive_Low()         LATDbits.LATD8    = 0
                #define ResistiveTouchScreen_YMinus_Config_As_Input()   TRISDbits.TRISD8  = 1  
                #define ResistiveTouchScreen_YMinus_Config_As_Output()  TRISDbits.TRISD8  = 0

            #elif defined(__dsPIC33E__)

    		    #define ADC_POT         5
    			#define ADC_XPOS        11
    			#define ADC_YPOS        10

                // ADC Port Control Bits
           		#define ADC_POT_PCFG	ANSELBbits.ANSB5
           		#define ADPCFG_XPOS		ANSELBbits.ANSB11
           		#define ADPCFG_YPOS		ANSELBbits.ANSB10
                
                #define RESISTIVETOUCH_ANALOG  1
                #define RESISTIVETOUCH_DIGITAL 0
    
                // X port definitions
                #define ResistiveTouchScreen_XPlus_Drive_High()         LATBbits.LATB11   = 1
                #define ResistiveTouchScreen_XPlus_Drive_Low()          LATBbits.LATB11   = 0
                #define ResistiveTouchScreen_XPlus_Config_As_Input()    TRISBbits.TRISB11 = 1
                #define ResistiveTouchScreen_XPlus_Config_As_Output()   TRISBbits.TRISB11 = 0
    			
                #define ResistiveTouchScreen_XMinus_Drive_High()        LATDbits.LATD9    = 1   
                #define ResistiveTouchScreen_XMinus_Drive_Low()         LATDbits.LATD9    = 0
                #define ResistiveTouchScreen_XMinus_Config_As_Input()   TRISDbits.TRISD9  = 1  
                #define ResistiveTouchScreen_XMinus_Config_As_Output()  TRISDbits.TRISD9  = 0

                // Y port definitions
                #define ResistiveTouchScreen_YPlus_Drive_High()         LATBbits.LATB10   = 1
                #define ResistiveTouchScreen_YPlus_Drive_Low()          LATBbits.LATB10   = 0
                #define ResistiveTouchScreen_YPlus_Config_As_Input()    TRISBbits.TRISB10 = 1
                #define ResistiveTouchScreen_YPlus_Config_As_Output()   TRISBbits.TRISB10 = 0
                
                #define ResistiveTouchScreen_YMinus_Drive_High()        LATDbits.LATD8    = 1   
                #define ResistiveTouchScreen_YMinus_Drive_Low()         LATDbits.LATD8    = 0
                #define ResistiveTouchScreen_YMinus_Config_As_Input()   TRISDbits.TRISD8  = 1  
                #define ResistiveTouchScreen_YMinus_Config_As_Output()  TRISDbits.TRISD8  = 0

    		#endif

        #endif

	#elif defined(MIKRO_BOARD)
	    #if defined(__PIC24FJ256GB110__)
            #define ADC_XPOS    13
            #define ADC_YPOS    12

            #define ADPCFG_XPOS AD1PCFGbits.PCFG13
            #define ADPCFG_YPOS AD1PCFGbits.PCFG12
            #define RESISTIVETOUCH_ANALOG  0
            #define RESISTIVETOUCH_DIGITAL 1

	        // X port definitions
            #define ResistiveTouchScreen_XPlus_Drive_High()         LATBbits.LATB13   = 1
            #define ResistiveTouchScreen_XPlus_Drive_Low()          LATBbits.LATB13   = 0
            #define ResistiveTouchScreen_XPlus_Config_As_Input()    TRISBbits.TRISB13 = 1
            #define ResistiveTouchScreen_XPlus_Config_As_Output()   TRISBbits.TRISB13 = 0
			
            #define ResistiveTouchScreen_XMinus_Drive_High()        LATBbits.LATB11   = 1   
            #define ResistiveTouchScreen_XMinus_Drive_Low()         LATBbits.LATB11   = 0
            #define ResistiveTouchScreen_XMinus_Config_As_Input()   TRISBbits.TRISB11 = 1  
            #define ResistiveTouchScreen_XMinus_Config_As_Output()  TRISBbits.TRISB11 = 0
 
        	// Y port definitions
            #define ResistiveTouchScreen_YPlus_Drive_High()         LATBbits.LATB12   = 1
            #define ResistiveTouchScreen_YPlus_Drive_Low()          LATBbits.LATB12   = 0
            #define ResistiveTouchScreen_YPlus_Config_As_Input()    TRISBbits.TRISB12 = 1
            #define ResistiveTouchScreen_YPlus_Config_As_Output()   TRISBbits.TRISB12 = 0
			
            #define ResistiveTouchScreen_YMinus_Drive_High()        LATBbits.LATB10   = 1   
            #define ResistiveTouchScreen_YMinus_Drive_Low()         LATBbits.LATB10   = 0
            #define ResistiveTouchScreen_YMinus_Config_As_Input()   TRISBbits.TRISB10 = 1  
            #define ResistiveTouchScreen_YMinus_Config_As_Output()  TRISBbits.TRISB10 = 0

		#endif
	#endif // end of #elif defined (GFX_PICTAIL_V3) || defined (GFX_PICTAIL_V3E) ...

	/*********************************************************************
	* Touch Screen X and Y orientation
	*********************************************************************/
	/*********************************************************************
	Description:
		The usage of the resistive touch screen will be affected 
		by the way the hardware is mapped to the A/D channels that
		samples the touch. Since resistive touch is basically a 
		measurement of X and Y coordinates the following are macros
		that can modify the touch algorithm when sampling the 
		touch.
		TOUCHSCREEN_RESISTIVE_FLIP_X - will flip the x direction. 	
		TOUCHSCREEN_RESISTIVE_FLIP_Y - will flip the y direction.
		TOUCHSCREEN_RESISTIVE_SWAP_XY - will swap the x and y sampling.
		
		As long as the (X-,Y-) and (X+,Y+) are used consistently,
		and connected properly in hardware, the macros above
		can provide options to the user to align the touch screen
		to the screen orientation.

